---
kind: method
id: M:Autodesk.Revit.DB.ElementParameterFilter.#ctor(Autodesk.Revit.DB.FilterRule)
source: html/70b5d168-237b-b2d1-28cb-b022116ada4a.htm
---
# Autodesk.Revit.DB.ElementParameterFilter.#ctor Method

Constructs a new instance of an ElementParameterFilter from a single rule.

## Syntax (C#)
```csharp
public ElementParameterFilter(
	FilterRule filterRule
)
```

## Parameters
- **filterRule** (`Autodesk.Revit.DB.FilterRule`) - The rule applied to test if the element passes this filter.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null